# forked from Github user @vyong1 ---> MemeBot
# https://github.com/vyong1/MemeBot/blob/master/ExtraThicc.py

map1 = {
    'a' : '卂',
    'b' : '乃',
    'c' : '匚',
    'd' : '刀',
    'e' : '乇',
    'f' : '下',
    'g' : '厶',
    'h' : '卄',
    'i' : '工',
    'j' : '丁',
    'k' : '长',
    'l' : '乚',
    'm' : '从',
    'n' : '𠘨',
    'o' : '口',
    'p' : '尸',
    'q' : '㔿',
    'r' : '尺',
    's' : '丂',
    't' : '丅',
    'u' : '凵',
    'v' : 'リ',
    'w' : '山',
    'x' : '乂',
    'y' : '丫',
    'z' : '乙',
    ' ' : '  '
}

map2 = {
    'a' : '𝔞',
    'b' : '𝔟',
    'c' : '𝔠',
    'd' : '𝔡',
    'e' : '𝔢',
    'f' : '𝔣',
    'g' : '𝔤',
    'h' : '𝔥',
    'i' : '𝔦',
    'j' : '𝔧',
    'k' : '𝔨',
    'l' : '𝔩',
    'm' : '𝔪',
    'n' : '𝔫',
    'o' : '𝔬',
    'p' : '𝔭',
    'q' : '𝔮',
    'r' : '𝔯',
    's' : '𝔰',
    't' : '𝔱',
    'u' : '𝔲',
    'v' : '𝔳',
    'w' : '𝔴',
    'x' : '𝔵',
    'y' : '𝔶',
    'z' : '𝔷',
    ' ' : ' '
}

map3 = {
    'a' : '𝓪',
    'A' : '𝓐', 
    'b' : '𝓫',
    'B' : '𝓑',
    'c' : '𝓬',
    'C' : '𝓒',
    'd' : '𝓭',
    'D' : '𝓓',
    'e' : '𝓮',
    'E' : '𝓔',
    'f' : '𝓯',
    'F' : '𝓕',
    'g' : '𝓰',
    'G' : '𝓖',
    'h' : '𝓱',
    'H' : '𝓗',
    'i' : '𝓲',
    'I' : '𝓘',
    'j' : '𝓳',
    'J' : '𝓙',
    'k' : '𝓴',
    'K' : '𝓚',
    'l' : '𝓵',
    'L' : '𝓛',
    'm' : '𝓶',
    'M' : '𝓜',
    'n' : '𝓷',
    'N' : '𝓝̃',
    'o' : '𝓸',
    'O' : '𝓞',
    'p' : '𝓹',
    'P' : '𝓟',
    'q' : '𝓺',
    'Q' : '𝓠',
    'r' : '𝓻',
    'R' : '𝓡',
    's' : '𝓼',
    'S' : '𝓢',
    't' : '𝓽',
    'T' : '𝓣',
    'u' : '𝓾',
    'U' : '𝓤',
    'v' : '𝓿',
    'V' : '𝓥',
    'w' : '𝔀',
    'x' : '𝔁',
    'y' : '𝔂',
    'z' : '𝔃',
    ' ' : ' '
}

map4 = {
    'a' : 'ɐ', 
    'b' : 'q',
    'c' : 'ɔ',
    'd' : 'p',
    'e' : 'ǝ',
    'f' : 'ɟ',
    'g' : 'ɓ',
    'h' : 'ɥ',
    'i' : 'ı',
    'j' : 'ɾ',
    'k' : 'ʞ',
    'l' : 'l',
    'm' : 'ɯ',
    'n' : 'u',
    'o' : 'o',
    'p' : 'd',
    'q' : 'b',
    'r' : 'ɹ',
    's' : 's',
    't' : 'ʇ',
    'u' : 'n',
    'v' : 'ʌ',
    'w' : 'ʍ',
    'x' : 'x',
    'y' : 'ʎ',
    'z' : 'z',
    ' ' : ' '
}

map5 = {
    'a' : '𝙖', 
    'b' : '𝙗',
    'c' : '𝙘',
    'd' : '𝙙',
    'e' : '𝙚',
    'f' : '𝙛',
    'g' : '𝙜',
    'h' : '𝙝',
    'i' : '𝙞',
    'j' : '𝙟',
    'k' : '𝙠',
    'l' : '𝙡',
    'm' : '𝙢',
    'n' : '𝙣',
    'o' : '𝙤',
    'p' : '𝙥',
    'q' : '𝙦',
    'r' : '𝙧',
    's' : '𝙨',
    't' : '𝙩',
    'u' : '𝙪',
    'v' : '𝙫',
    'w' : '𝙬',
    'x' : '𝙭',
    'y' : '𝙮',
    'z' : '𝙯',
    ' ' : ' '
}

map6 = {
    'a' : 'ᗩ', 
    'b' : 'ᗷ',
    'c' : 'ᑕ',
    'd' : 'ᗪ',
    'e' : 'E',
    'f' : 'ᖴ',
    'g' : 'ᘜ',
    'h' : 'ᕼ',
    'i' : 'I',
    'j' : 'ᒚ',
    'k' : 'ᖽ',
    'l' : 'ᒪ',
    'm' : 'ᗰ',
    'n' : 'ᑎ',
    'o' : 'O',
    'p' : 'ᑭ',
    'q' : 'ᑫ',
    'r' : 'ᖇ',
    's' : 'ᔕ',
    't' : 'ᖶ',
    'u' : 'ᑘ',
    'v' : 'ᐺ',
    'w' : 'ᘺ',
    'x' : '᙭',
    'y' : 'Y',
    'z' : 'ᘔ',
    ' ' : ' '
}

map7 = {
    'a' : 'ⓐ', 
    'b' : 'ⓑ',
    'c' : 'ⓒ',
    'd' : 'ⓓ',
    'e' : 'ⓔ',
    'f' : 'ⓕ',
    'g' : 'ⓖ',
    'h' : 'ⓗ',
    'i' : 'ⓘ',
    'j' : 'ⓙ',
    'k' : 'ⓚ',
    'l' : 'ⓛ',
    'm' : 'ⓜ',
    'n' : 'ⓝ',
    'o' : 'ⓞ',
    'p' : 'ⓟ',
    'q' : 'ⓠ',
    'r' : 'ⓡ',
    's' : 'ⓢ',
    't' : 'ⓣ',
    'u' : 'ⓤ',
    'v' : 'ⓥ',
    'w' : 'ⓦ',
    'x' : 'ⓧ',
    'y' : 'ⓨ',
    'z' : 'ⓩ',
    ' ' : ' '
}

'''map8 = {
    'a' : '', 
    'b' : '',
    'c' : '',
    'd' : '',
    'e' : '',
    'f' : '',
    'g' : '',
    'h' : '',
    'i' : '',
    'j' : '',
    'k' : '',
    'l' : '',
    'm' : '',
    'n' : '',
    'o' : '',
    'p' : '',
    'q' : '',
    'r' : '',
    's' : '',
    't' : '',
    'u' : '',
    'v' : '',
    'w' : '',
    'x' : '',
    'y' : '',
    'z' : '',
    ' ' : ' '
}'''

def tunear1(s):
    s = s.lower()
    s_new = ""
    for c in s:
        if c in map1:
            s_new += map1[c.lower()]
        else:
            s_new += c
    return s_new

def tunear2(s):
    s = s.lower()
    s_new = ""
    for c in s:
        if c in map2:
            s_new += map2[c.lower()]
        else:
            s_new += c
    return s_new

def tunear3(s):
    s = s.lower()
    s_new = ""
    for c in s:
        if c in map3:
            s_new += map3[c.lower()]
        else:
            s_new += c
    return s_new

def tunear4(s):
    s = s.lower()
    s_new = ""
    for c in s:
        if c in map4:
            s_new += map4[c.lower()]
        else:
            s_new += c
    return s_new

def tunear5(s):
    s = s.lower()
    s_new = ""
    for c in s:
        if c in map5:
            s_new += map5[c.lower()]
        else:
            s_new += c
    return s_new

def tunear6(s):
    s = s.lower()
    s_new = ""
    for c in s:
        if c in map6:
            s_new += map6[c.lower()]
        else:
            s_new += c
    return s_new

def tunear7(s):
    s = s.lower()
    s_new = ""
    for c in s:
        if c in map7:
            s_new += map7[c.lower()]
        else:
            s_new += c
    return s_new

